{
  "metadata": {
    "target_company": "1Password",
    "target_role": "Vice President of Data Analytics",
    "date_applied": "2026-02-01",
    "status": "draft",
    "notes": "VP-level, reports to CFO. Strong fit on leadership, governance, cross-functional translation, technical depth. Gaps: no Tableau/Looker/Power BI, no SaaS or cybersecurity domain experience. High comp range ($272-368k)."
  },
  "header": {
    "name": "Matt Oremland, PhD",
    "target_title": "Vice President of Data Analytics",
    "email": "mattoremland@gmail.com",
    "phone": "(518) 560-1473",
    "location": "Saratoga Springs, NY 12866",
    "linkedin": "https://www.linkedin.com/in/matthew-oremland-31a312101"
  },
  "summary": "Executive analytics leader with 10+ years of experience defining data strategy, building analytics organizations, and driving data-driven decision-making across complex enterprises. Proven ability to serve as the bridge between technical teams and senior business stakeholders, translating business priorities into analytical frameworks and delivering actionable insights that influence strategic outcomes. Deep hands-on technical expertise in Python, SQL, predictive modeling, and data infrastructure combined with a track record of establishing data governance, leading cross-functional teams, and scaling analytics capabilities from the ground up.",
  "experience": [
    {
      "company": "Redica Systems",
      "title": "Director, Data Strategy & Analytics",
      "start": "2025",
      "end": "Present",
      "location": "Remote",
      "bullets": [
        "Define and execute analytics strategy for a life science platform, partnering with product and commercial teams to translate business objectives into data solutions and actionable client-facing insights",
        "Built risk-scoring models from scratch, designing the end-to-end pipeline from raw data ingestion and quality remediation through model development, validation, and operationalization",
        "Designed a reference data architecture to harmonize data from multiple clients and external sources into a unified internal framework, establishing governance standards for consistency and accuracy",
        "Developed a Python visualization library to standardize analytics output across the organization, reducing manual effort and ensuring reproducibility across deliverables"
      ]
    },
    {
      "company": "Tidal Wave Analytics LLC",
      "title": "Consulting Data Scientist",
      "start": "2023",
      "end": "Present",
      "location": "Saratoga Springs, NY",
      "bullets": [
        "Delivered end-to-end predictive modeling engagements across multiple industries, managing full project lifecycle from scoping and stakeholder alignment through deployment and iteration",
        "Built a production classification model for a SaaS platform that runs nightly, demonstrating ability to operate in fast-moving product environments",
        "Partnered directly with VP-level client stakeholders and engineering teams, translating complex analytical outputs into actionable business recommendations"
      ]
    },
    {
      "company": "Gilead Sciences",
      "title": "Director, Data & Analytics (Medical Affairs)",
      "start": "2023",
      "end": "2024",
      "location": "Foster City, CA",
      "bullets": [
        "Defined and executed enterprise data and analytics strategy, serving as strategic advisor to senior leadership and aligning analytics roadmap with organizational business objectives",
        "Led development of a centralized data lake as the single source of truth for analytics and reporting across the organization, improving data accessibility and enabling self-service capabilities",
        "Managed the analytics team through hiring, onboarding, and performance development, building a high-performing group focused on dashboard and reporting delivery",
        "Established data governance frameworks and formal data requirements to ensure data quality, consistency, and transparency - serving as the primary owner of metric definitions and validation",
        "Managed vendor relationships and internal teams to deliver analytics solutions on time and within budget, maintaining accountability for output quality and business impact"
      ]
    },
    {
      "company": "Takeda Pharmaceuticals",
      "title": "Associate Director, Digital & Data Science",
      "start": "2021",
      "end": "2022",
      "location": "Lexington, MA",
      "bullets": [
        "Led the digital and data science group and the statistical monitoring group, providing cross-functional analytics leadership across manufacturing, quality, and operations stakeholders",
        "Partnered with senior leaders to implement predictive modeling programs, translating complex model outputs into clear business recommendations that drove quality decision-making",
        "Led semi-annual Annual Product Quality Review meetings, presenting data-driven assessments and forward-looking insights to executive leadership",
        "Built real-time monitoring dashboards and served as platform administrator, ensuring analytics tools were reliable, scalable, and accessible to business users"
      ]
    },
    {
      "company": "Regeneron Pharmaceuticals",
      "title": "Senior Process Data Scientist",
      "start": "2016",
      "end": "2021",
      "location": "Rensselaer, NY",
      "bullets": [
        "Developed and deployed predictive models for manufacturing operations including automated limit calculations, process optimization, and product quality prediction using ensemble methods, PLS, and PCA",
        "Built and maintained automated data pipelines to ingest, clean, and transform process data from multiple systems into analysis-ready formats at scale",
        "Served as a technical leader and cross-functional translator, presenting modeling results and strategic recommendations to senior leadership and operational stakeholders",
        "Promoted from Data Scientist to Senior Data Scientist based on expanded technical scope and leadership contributions"
      ]
    }
  ],
  "education": [
    {
      "institution": "Virginia Polytechnic Institute & State University",
      "degree": "Doctor of Philosophy (PhD)",
      "field": "Mathematics",
      "year": "2014",
      "details": ""
    }
  ],
  "skills": [
    {
      "category": "Leadership & Strategy",
      "items": ["Analytics Strategy", "Team Leadership", "Cross-Functional Partnership", "Executive Stakeholder Management", "Data Governance", "Hiring & Mentoring"]
    },
    {
      "category": "Programming & Analytics",
      "items": ["Python", "SQL", "Predictive Modeling", "Data Pipelines", "Statistical Methods", "Machine Learning"]
    },
    {
      "category": "Platforms & Infrastructure",
      "items": ["Snowflake", "Databricks", "AWS", "Sigma", "Spotfire", "Data Warehousing"]
    },
    {
      "category": "Business & Governance",
      "items": ["KPI Design", "Data Quality Management", "Metric Definition & Validation", "Dashboard Development", "Vendor Management", "Strategic Planning"]
    }
  ],
  "presentations": [],
  "publications": [],
  "cover_letter": {
    "opening": "I am writing to express my strong interest in the Vice President of Data Analytics role at 1Password. The opportunity to define analytics strategy, elevate data maturity, and serve as the bridge between technical teams and senior business leaders at a company of 1Password's scale and growth trajectory is exactly the kind of challenge I have been building toward across my career.",
    "body": [
      "My background is built on doing exactly what this role requires: translating business priorities into analytical frameworks, building analytics organizations from the ground up, and ensuring data becomes a trusted, actionable asset across an enterprise. At Gilead Sciences, I served as Director of Data & Analytics, where I defined enterprise analytics strategy, built the organization's centralized data lake, established data governance and metric-definition frameworks, and led the internal analytics team through hiring and development - all while functioning as a strategic advisor to senior leadership. At Takeda, I led both the digital and data science function and the statistical monitoring group, partnering across manufacturing, quality, and operations to translate complex analytics into business decisions that leadership could act on. In both roles, I owned the full scope from technical infrastructure to executive communication.",
      "I am a hands-on leader who stays close to the technical work while operating at a strategic level. At Redica Systems, I personally built the risk-scoring models and data architecture that power the platform's client-facing analytics, while simultaneously defining the analytics strategy and partnering with product teams on priorities. Through my consulting practice, I have delivered production-grade modeling engagements for SaaS platforms, working directly with VP-level stakeholders and engineering teams. This combination of deep technical fluency and cross-functional leadership is what enables me to serve as an effective bridge - and it is the core of what I would bring to 1Password.",
      "1Password's mission to make digital life safer and more productive, combined with the company's rapid growth and the breadth of this role's scope, represents a compelling opportunity. I would welcome the chance to discuss how my experience in analytics strategy, data governance, and cross-functional leadership can contribute to advancing data maturity and decision-making across your organization."
    ],
    "closing": "Thank you for your time and consideration. I look forward to the possibility of continuing this conversation."
  }
}
